Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase.description
The object type description.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase.ManipulatorManager
The manipulator manager.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase.Initialize
Initializes the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase.Refresh
Refreshes the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase.OnActivated(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase.OnRefreshSuggested(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase.GetActivationDefinitions
